#ifndef D2_STRUCTS_H
#define D2_STRUCTS_H

#include <windows.h>

struct GfxCell;
struct CellFile;
struct CellContext;
struct PresetUnit;
struct RoomTile;
struct DrlgRoom1;
struct DrlgRoom2;
struct DrlgLevel;
struct DrlgMisc;
struct DrlgAct;
struct AutomapCell;
struct AutomapLayer;
struct LevelDefTxt;
struct ObjectTxt;
struct LevelTxt ;
struct ItemTxt;
struct MonsterTxt;
struct SuperUniqueTxt;
struct SetItemTxt;
struct ItemProp;
struct UniqueItemTxt;
struct RuneWordTxt;

struct PlayerData;
struct MonsterData;
struct ObjectData;
struct MissileData;
struct ItemData;
struct UnitInventory ;

struct StaticPath;
struct DynamicPath;
struct UnitAny;
struct RosterUnit;
struct PetUnit;
struct MonsterMinion;


struct TreasureClassItem ;
struct TreasureClass;
struct GameStructInfo;
struct D2MSG;
struct D2EditBox ;
struct QuestInfo;
struct Waypoint;
struct StatList;
struct SkillInfo;
struct Skill;

struct D2Seed {
	DWORD	dwLowSeed;
	DWORD	dwHighSeed;
};


struct DrlgAct {
	DWORD  _1[4];			//+00
	DrlgRoom1 *pRoom1;		//+10
	DWORD	dwActNo;		//+14
	DWORD  _2[12];			//+18
	DrlgMisc *pDrlgMisc;	//+48
};

struct DrlgMisc {
	DWORD	_1[37];				//+00
	DWORD	dwStaffTombLvl;		//+94
	DWORD	_2[248];			//+98
	DWORD	*pMemPool;			//+478
	DrlgLevel *pLevelFirst;		//+47C
	DWORD	_3;					//+480
	DWORD	dwBossTombLvl;		//+484
};

struct DrlgLevel {
	DWORD	_1[4];			//+00
	DrlgRoom2 *pRoom2First; //+10
	DWORD	_2[102];		//+14
	DrlgLevel *pNext;		//+1AC
	DWORD	_3;				//+1B0
	DrlgMisc  *pDrlgMisc;	//+1B4 
	DWORD	_4[2];			//+1B8	
	DWORD	dwLvlType;		//+1C0
	DWORD	_5[3];			//+1C4			
	DWORD	dwLevelNo;		//+1D0
};

struct DrlgRoom2 {
	DWORD   _1[2];			 //+00
	DrlgRoom2 **paRoomsNear; //+08
	DWORD   _2[5];			 //+0C
	struct{
		DWORD dwDef;		
	}	*pLvlPreset;		 //+20
	DrlgRoom2  *pNext;		 //+24
	DWORD   dwRoomTiles;	 //+28
	DWORD	dwRoomsNear;	 //+2C
	DrlgRoom1 *pRoom1;	     //+30
	DWORD	dwPosX;			 //+34
	DWORD	dwPosY;			 //+38
	DWORD	dwSizeX;		 //+3C
	DWORD	dwSizeY;		 //+40
	DWORD   _4;				 //+44
	DWORD	dwPresetType;	 //+48
	RoomTile *pRoomTiles;	 //+4C
	DWORD   _5[2];			 //+50
	DrlgLevel *pDrlgLevel;	 //+58
	PresetUnit *pPresetUnits;//+5C	
};
struct DrlgRoom1 {
	DrlgRoom1 **paRoomsNear; //+00
	DWORD   _1[3];			 //+04				
	DrlgRoom2 *pRoom2;		 //+10
	DWORD	_2[4];			 //+14
	DWORD	dwRoomsNear;	 //+04
	//DWORD	_3[21];			 //+14
	UnitAny* _3[19];			 //+28
	UnitAny* pUnitFirst;
	DrlgAct* pact;			//+78
	DrlgRoom1 *pNext;		 //+7C
};

struct RoomTile {
	DrlgRoom2 *pRoom2;	//+00
	RoomTile  *pNext;	//+04
	DWORD	  _1[2];	//+08
	DWORD	  *pNum;	//+10
};

struct PresetUnit {
	DWORD	_1;			 //+00
	DWORD	dwTxtFileNo; //+04
	DWORD	dwPosX;		 //+08
	PresetUnit *pNext;   //+0C
	DWORD	_2;			 //+10
	DWORD	dwUnitType;  //+14
	DWORD	dwPosY;		 //+18
};

struct AutomapCell {
	DWORD	fSaved;		//+00
	WORD	wCellNo;	//+04
	WORD	xPixel;		//+06
	WORD	yPixel;		//+08
	WORD	wWeight;	//+0A = -1, 0, 1
	AutomapCell *pLess; //+0C
	AutomapCell *pMore; //+10
};

struct AutomapLayer {
	DWORD	dwLayerNo;		//+00
	DWORD	fSaved;			//+04
	AutomapCell	*pFloors;	//+08
	AutomapCell *pWalls;	//+0C
	AutomapCell *pObjects;	//+10
	AutomapCell *pExtras;	//+14
	AutomapLayer *pNext;	//+18
};


struct GfxCell {
	DWORD	dwFlags;	//+00
	DWORD	dwWidth;	//+04
	DWORD	dwHeight;	//+08
	DWORD	dwXoffs;	//+0c
	DWORD	dwYoffs;	//+10
	DWORD	_2;
	DWORD	dwParent;	//+18
	DWORD	dwLength;	//+1c
	BYTE	nCols[1];	//+20
};

struct CellFile {
	DWORD	dwVersion;		//+00
	struct 
	{
		WORD dwFlags;
		BYTE mylastcol;
		BYTE mytabno:1;
	};						//+04
	DWORD	eFormat;		//+08
	DWORD	dwTermination;	//+0C
	DWORD	dwNumdirs;		//+10
	DWORD	dwNumCells;		//+14
	GfxCell	*pCells[1];		//+18
};

struct CellContext {
	DWORD		dwCellNo;		//+00
	DWORD		dwDirNo;		//+04  (0-63, other values asplode even when file has more dirs) 
	DWORD		dwDirection;	//+08
	DWORD		_1[10];			//+0C
	CellFile	*pCellFile ;	//+34
	DWORD		_2[3];			//+3C 一定要凑足0x48的长度，不然初始化错误
};

struct Light {
    DWORD _1[3];         // 0x00
    DWORD dwType;        // 0x0C
    DWORD _2[7];         // 0x10
    DWORD dwStaticValid; // 0x2C
    int* pnStaticMap;    // 0x30
};

struct UnitAny {
	DWORD	dwUnitType;		//+00
	DWORD	dwTxtFileNo;	//+04
	DWORD	*pMemPool ;		//+08	not used, always NULL 
	DWORD	dwUnitId;		//+0C
	DWORD	dwMode;			//+10
			/*mode index from   PlrMode.txt  MonMode.txt  ObjMode.txt  
					Missiles, Items and VisTiles have their own modes (for missiles this holds the collision type) 
					eItemModes 3=on the floor
			*/
	union {
		PlayerData *pPlayerData; 
		MonsterData *pMonsterData; 
		ObjectData *pObjectData; 
		ItemData *pItemData; 
		MissileData  *pMissileData; 
	};	//+14
	DWORD	dwAct;			//+18
	DrlgAct *pDrlgAct;		//+1C
	D2Seed	seed;			//+20	
	DWORD	dwInitSeed ;	//+28
	union {
		StaticPath	*pItemPath;	//	(Objects, VisTiles, Items) 
        DynamicPath	*pMonPath;	//	(Players, Monsters, Missiles) 
	};	//+2C
	DWORD	_1[11];	//+30
	StatList *pStatList;	//+5C	
	UnitInventory *pInventory; //+60
	Light*  ptLight;           // 0x64
        DWORD   dwStartLightRadius; // 0x68
	WORD    nPl2ShiftIdx;        // 0x6C
	WORD    nUpdateType;         // 0x6E
	UnitAny* pUpdateUnit;     // 0x70 - Used when updating unit.
	DWORD*  pQuestRecord;      // 0x74
	DWORD   bSparklyChest;      // 0x78 bool
	DWORD*  pTimerArgs;        // 0x7C
	DWORD   dwSoundSync;        // 0x80
	DWORD   _6[2];              // 0x84
	WORD    wX;                  // 0x8C
	WORD    wY;                  // 0x8E
	DWORD   _7;                 // 0x90
	DWORD	dwOwnerType;	//+94
	DWORD	dwOwnerId;		//+98
	DWORD	_3[3];		//+9C
	SkillInfo *pSkill;		//+A8
	DWORD	_4[6];			//+AC
	DWORD	dwFlags1;		//+C4
	DWORD	dwFlags2;		//+C8
	DWORD	_5[6];			//+CC
	UnitAny *pRoomNext;		//+E4
	UnitAny *pListNext;		//+E8
};

struct PvPInfo {			//size = 0x0C
	DWORD	dwUnitId;		//+00
	DWORD	dwFlag;			//+04	0000 正常 0001 开锁 0010 静音 0100  缄默 1000 敌对
	PvPInfo *pNext;			//+08

};

struct MonsterMinion {		//随从信息,一般都空
	DWORD	dwUnitId;		//+00
	MonsterMinion *pNext;	//+04

};
struct RosterUnit { 
   char		szName[16];			//0x00 
   DWORD	dwUnitId;			//0x10 
   DWORD	dwPartyLife;		//0x14 
   DWORD	dwKills;			//0x18 ?
   DWORD	dwClassId;			//0x1C 
   WORD		wLevel;				//0x20 
   WORD		wPartyId;			//0x22 
   DWORD	dwLevelNo;			//0x24 
   DWORD	dwPosX;				//0x28 
   DWORD	dwPosY;				//0x2C 
   DWORD	dwPartyFlags;		//0x30 
   PvPInfo	**pPvPInfo;			//0x34 
   MonsterMinion **pMinon;		//0x38 
   DWORD	_6[10];				//0x3C 
   WORD		_7;					//0x64 
   char		szName2[16];		//0x66 
   WORD		_8;					//0x76 
   DWORD	_9[2];				//0x78 
   RosterUnit * pNext;			//0x80 
};

struct PetUnit {
	DWORD	dwTxtFileNo;		//+00 对应monstats.tx的hcidx
	DWORD	dwPetType;			//+04 对应pettype.txt
	DWORD	dwUnitId;			//+08
	DWORD	dwOwnerId;			//+0C 主人GUID
	DWORD	dwFlag1;			//+10
	DWORD	dwOffsetX;			//+14 不确定
	DWORD	dwOffsetY;			//+18 不确定
	DWORD	dwHpPercent;		//+1C
	DWORD	dwOwerType;			//+20  
	DWORD	dwInitSeed;			//+24  雇佣时生成，不再变化
	WORD	wLocaleTxtNo;		//+28  名字索引 for pet
	BYTE	_1[6];				//+2A
	PetUnit *pNext;				//+30
};

struct StatEx {			//size 8
	WORD wParam;	
	WORD wStatId;		//statNo from ItemStatCost.txt
	DWORD dwStatValue;
};
struct Stat{
	StatEx	(*pStat)[30];	//实际长度由wStats确定，以树结构查找 30只是为了测试
	WORD	wStats;			
	WORD	wSizeInBits;
};

// StatList 和StatListEx多态结构，通过dwListFlag区分 , 0x80000000为StatListEx
// sizeof(StatListEx) = 0x64  sizeof(StatList) = 0x40  
struct StatList {				
	DWORD	pMemPool;			//+00	always NULL
	UnitAny	*pUnit;				//+04	the unit to which the list is attached   for StatListEx & item = item owner
	DWORD	dwOwnerType;		//+08
	DWORD	dwOwnerId;			//+0C
	DWORD	dwListFlag;			//+10
	DWORD	dwStateNo;			//+14
	DWORD	dwExpireFrame;		//+18	the frame at which the state expires 
	DWORD	dwSkillNo;			//+1C	Id of the skill that created the stat list
	DWORD	dwSkillLvl;			//+20	level of the skill that created the stat list 
	Stat	sBaseStat ;			//+24
	StatList *pPrevList;		//+2C	previous list on this unit 
	StatList *pNextLis;			//+30	next list on this unit 
	StatList *pPrev;			//+34	previous list;  for StatListEx , if this one is owned by a item, this points to the item owners list
	union {
		void (__fastcall *func)(UnitAny* ,DWORD ,BOOL);//StatList  function to call when the list is removed 
		StatList *pNextListEx;						   //next StatListEx
	};							//+38
	StatList *pNext;			//+3C	next list  for StatListEx = MyLastList
	//only for StatListEx
	StatList *pMyStatList;		//+40
	UnitAny	 *pUnitOwner;		//+44	StatListEx owner
	Stat	sFullStat ;			//+48
	Stat	sModStat ;			//+50
	void	*StatFlags;			//+58
	void	*fCallback;			//+5C function to call by SetStat, AddStat when a fcallback stat changes
	void	*pGame;				//+60 on server
};

struct DynamicPath {
	WORD	wOffsetX;		//+00
	WORD	wPosX;			//+02
	WORD	wOffsetY;		//+04
	WORD	wPosY;			//+06
	DWORD	dwMapPosX;		//+08
	DWORD	dwMapPosY;		//+0C
	WORD	wTargetX;		//+10
	WORD	wTargetY;		//+12
	DWORD	_2[2];			//+14
	DrlgRoom1 *pRoom1;		//+1C
	DrlgRoom1 *pRoomUnk;	//+20
	DWORD	_3[3];			//+24
	UnitAny *pUnit;			//+30
	DWORD	dwFlags;		//+34
	DWORD	_4;				//+38
	DWORD	dwPathType;		//+3C
	DWORD	dwPrevPathType;	//+40
	DWORD	dwUnitSize;		//+44
	DWORD	_5[4];			//+48
	UnitAny *pTargetUnit;	//+58
	DWORD	dwTargetType;	//+5C
	DWORD	dwTargetId;		//+60
	BYTE	nDirection;		//+64
};

struct StaticPath {
	DrlgRoom1 *pRoom1;		//+1C
	DWORD	dwMapPosX;		//+04
	DWORD	dwMapPosY;		//+08
	DWORD	dwPosX;			//+0C
	DWORD	dwPosY;			//+10
};

struct SkillInfo {
	DWORD *pGame1C;			//+00
	Skill *pFirstSkill;		//+04
	Skill *pLeftSkill;		//+08
	Skill *pRightSkill;		//+0C
	Skill *pCurrentSkill;	//+10
};

struct Skill {
	struct {
		WORD	wSkillId;
	} *pSkillInfo;			//+00
	Skill	*pNextSkill;	//+04
	DWORD	dwMode;			//+08
	DWORD	dwFlag0;		//+0C
	DWORD	_1[2];			//+10
	DWORD	dwTagets;		//+18
	DWORD	dwTargetType;	//+1C unit type
	DWORD	dwTargetId;		//+20 unit id
	DWORD	_2;				//+24
	DWORD	dwSkillLevel;	//+28
	DWORD	dwLevelBonus;	//+2C
	DWORD	dwQuality;		//+30  质量 ==> 回城书之类的数量
	DWORD	dwFlags;		//+34
};


struct QuestInfo {
	DWORD *pBuffer;					//0x00
	DWORD _flag;
};

struct Waypoint {
	DWORD flags;					//0x00
};

struct PlayerData {
	char	szName[16];				//+00   len of charname <= 15 
	QuestInfo *pNormalQuest;		//0x10
	QuestInfo *pNightmareQuest;		//0x14
	QuestInfo *pHellQuest;			//0x18
	Waypoint *pNormalWaypoint;		//0x1c
	Waypoint *pNightmareWaypoint;	//0x20
	Waypoint *pHellWaypoint;		//0x24
};


struct MissileData{
	BYTE	_1[8];			//+00
	WORD	wActivateFrame;	//+08	Activate column from Missiles.txt 
	WORD	wLvl;			//+0A
	WORD	wSkillNo;		//+0C
	WORD	wTotalFrames;	//+0E	the number of frames before the missile vanishes from Missiles.txt 
	DWORD	dwCurrentFrame;	//+10	the current traveling frame
	DWORD	dwMissileFlags;	//+14	this depends on the missile functions used 
	DWORD	dwOwnerType;	//+18	unit type of the missile owner 
	DWORD	dwOwnerId;		//+1C	global unique identifier of the missile owner 
	DWORD	dwUnitType;		//+20	unit type of a target, for homing missiles 
	DWORD	dwUnitId;		//+24	global unique identifier of a target, for homing missiles 
	DWORD	dwHomeStatus;	//+28	for homing missiles like Guided Arrow 
	struct {
		WORD	xPos;
		WORD	yPos;
	}	sCoordShort;
};

struct MonsterData {
	MonsterTxt	*pMonsterTxt;	//+00
	BYTE	nComponents[16];	//+04	Order: HD, TR, LG, RA, LA, RH, LH, SH, S1, S2, S3, S4, S5, S6, S7, S8
	WORD	wNameSeed;			//+14;
	union{
		BYTE	bTypeFlags;	//+16
		struct {
			BYTE fOther:1;		//set for some champs, uniques
			BYTE fUnique:1;		//super unique
			BYTE fChamp:1;		
			BYTE fBoss:1;		//unique monster ,usually boss
			BYTE fMinion:1;		
			BYTE fPoss:1;		//possessed
			BYTE fGhost:1;		//ghostly
			BYTE fMulti:1;		//multishotfiring
		}; //+16
	};//+16
	BYTE	nLastMode;			//+17
	DWORD	dwDuriel;			//+18
	BYTE	anEnchants[9];		//+1C
	BYTE	_1;					//+25
	WORD	wUniqueNo;			//+26	hcIdx from superuniques.txt for superuniques 
	void	*pAiGeneral;		//+28
	wchar_t	*wszMonName;		//+2C	server side is pAiParams
	BYTE	_2[16];				//+30
	DWORD	dwNecroPet;			//+40
	BYTE	_3[16];				//+44
	DWORD	dwAiState;			//+54	this is used to tell monsters what special state has been set, this tells them they just got attacked etc
	DWORD	dwLevelNo;			//+58	the Id from levels.txt of the level they got spawned in 
	BYTE	nSummonerFlags;		//+5C	byte used only by the summoner
};


struct ObjectData {
	ObjectTxt *pObjectTxt;		//+00
	union {
		BYTE	nShrineNo;
		struct {
			BYTE _1:7;
			BYTE fChestLocked:1;
		};
	}; 
};

struct ItemData { 
	DWORD	dwQuality;			//+00 
	D2Seed	seed;				//+04
	DWORD	dwOwnerId;			//+0C -1 when not owned by player, otherwise equal to player GUID 
	DWORD	dwFingerPrint;		//+10	initial spawning seed
	DWORD	dwCommandFlags;		//+14
	DWORD	dwItemFlags;		//+18 
	DWORD	_1[2];				//+1C 
	DWORD	ActionStamp;		//+24
	DWORD	dwFileIndex;		//+28 index from data files UniqueItems.txt, SetItems.txt, QualityItems.txt, LowQualityItems.txt
	DWORD	dwItemLevel;		//+2C	ILvl
	WORD	wItemFormat;		//+30
	WORD	wRarePrefix;		//+32
	WORD	wRareSuffix;		//+34
	WORD	wAutoPrefix;		//+36
	WORD	wMagicPrefix[3];	//+38 
	WORD	wMagicSuffix[3];	//+3E 
	BYTE	nBodyLocation;		//+44 Id from BodyLocs.txt;this field isn't always cleared , use D2Common.#11003 instead of checking this 
	BYTE	nItemLocation;		//+45 -1 equiped 0 Inventory , 3 cube , 4 stash  
	BYTE	_2[2];				//+46 
	BYTE	nEarLevel;			//+48
	BYTE	nInvGfxIdx;			//+49
	char	szPlayerName[16];	//+4A	//used for Ears and Personalized items 
	BYTE	_3[2];				//+5A
	UnitInventory *pOwnerInventory;		//0x5C for socketed items this points to the inventory of the parent item
	DWORD	_4;					//+60 
	UnitAny *pNextInvItem;		//+64	item filling the next socket, if pNodeOwnerInventory is set 
	BYTE	_11;				//+68 
	BYTE	nLocation;			//+69 Actual location, 0 ground, 1 cube/stash/inv,2 belt,3 body
}; 



struct UnitInventory 
{ 
	DWORD	dwInvStamp;			//+00 0x1020304, used to verify the inventory is valid 
	void	*pMemPool;			//+04 always NULL
	UnitAny *pOwner;			//+08 
	UnitAny *pFirstItem;		//+0C 
	UnitAny *pLastItem;			//+10 
	UnitInventory *pInvInfo;	//+14 list of pointers to equipped gear 
	DWORD	dwInvInfoCount;		//+18 count for above 
	DWORD	dwWeaponId;			//+1C
	UnitAny *pCursorItem;		//+20 points to self on items that aren't placed into sockets ,for player point to cursor item
	DWORD	dwOwnerId;			//+24 
	DWORD	dwFilledSockets;	//+28 
};



struct TreasureClassItem {	//size = 0x1C 长度一定要凑足，不然使用时有问题
	DWORD _1[2];		//+00
	DWORD dwThingNo;	//+08
	struct {
